Revit 2024 API
CompoundStructure.IsLayerValid Method
 Verifies that the data in this layer is internally consistent.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsLayerValid(
	int layerIdx,
	CompoundStructureLayer layer
)
Visual Basic
Public Function IsLayerValid ( _
	layerIdx As Integer, _
	layer As CompoundStructureLayer _
) As Boolean
Visual C++
public:
bool IsLayerValid(
	int layerIdx,
	CompoundStructureLayer^ layer
)
Parameters
layerIdx
Type: System.Int32
 The index of the layer in the compound structure to be set.
layer
Type: Autodesk.Revit.DB.CompoundStructureLayer
 The layer to be set.
Return Value
 True if the layer is internally consistent, false if the layer is not internally consistent.
Remarks
 If the layer function is not Membrane or StructuralDeck, the width must be greater than zero. If the layer function is not StructuralDeck, then the deck embedding type must be Invalid, and the deck profile id must be InvalidElementId.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace